
#Область СлужебныйИнтерфейс

//Возвращает структуру для удобства создания нового ответа для фиксации ведущим
//
// Возвращаемое значение:
//   Структура
//   * Квиз - СправочникСсылка.Квизы 
//   * Команда - СправочникСсылка.Команды 
//   * Раунд - ОпределяемыйТип.Раунд 
//   * Вопрос - СправочникСсылка.Вопросы 
//
Функция НовоеОписаниеОтвета() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Квиз");
	Результат.Вставить("Команда");
	Результат.Вставить("Раунд");
	Результат.Вставить("Вопрос");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

