#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
 
#Область ОбработчикиСобытий
 
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ПоследнийНомер = ПоследнийНомерРаундаКвиза(Владелец);
		ПорядковыйНомер = ПоследнийНомер + 1;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
 
#Область СлужебныеПроцедурыИФункции

Функция ПоследнийНомерРаундаКвиза(Квиз)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(Раунды.ПорядковыйНомер) КАК ПорядковыйНомер
	|ИЗ
	|	Справочник.Раунды КАК Раунды
	|ГДЕ
	|	Раунды.Владелец = &Квиз";
	
	Запрос.УстановитьПараметр("Квиз", Квиз);
	РезультатЗапроса = Запрос.Выполнить();
	
	НомерРаунда = 1;
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		НомерРаунда = Выборка.ПорядковыйНомер;
	КонецЕсли;
	
	Возврат НомерРаунда;
	
КонецФункции

#КонецОбласти
 
#Иначе
   ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
