
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьДоступностьЭлементов(Параметры);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьДоступностьЭлементов(Параметры)
	
	РедактированиеРазрешено = Параметры.ПараметрыВыбора.Свойство("Владелец");
	
	Элементы.Владелец.ТолькоПросмотр = РедактированиеРазрешено;
	Элементы.ПорядковыйНомер.ТолькоПросмотр = РедактированиеРазрешено;
	
КонецПроцедуры

#КонецОбласти
